{
  "backend/main.mo": "Motoko actor defining participant registration and prize management with persistent storage using Maps, including age categories, default prize structure (overall and age-based categories), and comparison functions for sorting.",
  "feature_evidence.json": "Feature evidence report documenting two features: replacing deployment QR/link with Jhajha Marathon branding and fixing prizes display functionality, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration for the Jhajha Marathon registration application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system, defining colors for UI elements like background, primary, accent, borders, and charts.",
  "frontend/index.html": "HTML entry point for the Jhajha Marathon Organizer application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with three routes (home, register, prizes) wrapped in a Layout component.",
  "frontend/src/components/DeploymentInfo.tsx": "Component displaying Jhajha Marathon official website URL (https://jhajhamarathon.com) with QR code image and copy-to-clipboard functionality for sharing.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky header featuring Jhajha Marathon branding, responsive navigation menu, and footer with organizer contact (7069180465) and caffeine.ai attribution.",
  "frontend/src/components/PaymentDetails.tsx": "Payment information component displaying ₹100 entry fee banner, PhonePe QR code image, UPI ID (7069180465@ybl), and payee name (Raman Kumar Asbariya) with copy functionality.",
  "frontend/src/components/PrizesDisplay.tsx": "Displays marathon prizes filtered by 'overall' category (1st, 2nd, 3rd place) with loading/error states, a banner for participant medals, and styled prize cards with placement-specific icons and colors.",
  "frontend/src/components/RegistrationForm.tsx": "React form component using react-hook-form for participant registration with fields for name, email, phone, address, and age category; handles submission via mutation and shows RegistrationSuccess on completion.",
  "frontend/src/components/RegistrationSuccess.tsx": "Success screen component displayed after registration, showing the participant ID, next steps instructions, and action buttons to view prizes or return home.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching participants and prizes, and a mutation hook for registering participants, all using the backend actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, accent, destructive, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component featuring a hero banner with event branding, call-to-action buttons for registration and prizes, event info cards (date, location, categories), and deployment info section.",
  "frontend/src/pages/PrizesPage.tsx": "Prizes page component that displays a header with trophy icon and renders the PrizesDisplay component to show cash prizes and awards for different categories.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page component containing a hero banner, payment details section with UPI/QR code, registration instructions, and the RegistrationForm component for participant sign-up.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH format, typography settings, container queries, animations, and custom utility classes.",
  "project_state.json": "Project metadata tracking schema version, known issues (prizes section not loading), existing features (QR code branding replacement, prizes display fix), and pending feature requests."
}