{
  "backend/main.mo": "Motoko actor defining participant registration with age categories, prize management with default overall and age-group prizes, and query functions for retrieving participants and prizes.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing category grouping from prizes display and removing the 'more prizes to be announced' section from PrizesDisplay.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration for the Jhajha Marathon registration application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Jhajha Marathon Organizer application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, register, and prizes pages, all wrapped in a Layout component.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky gradient header, responsive navigation menu, marathon branding with trophy icon, and footer containing organizer contact (7069180465) and caffeine.ai attribution.",
  "frontend/src/components/PaymentDetails.tsx": "Payment information component displaying ₹100 entry fee banner, PhonePe QR code image, UPI ID (7069180465@ybl), and payee name (Raman Kumar Asbariya) with copy functionality.",
  "frontend/src/components/PrizesDisplay.tsx": "Displays prizes fetched from backend with prominent medal banner for all participants, followed by a flat grid of prize cards with placement-specific colors and icons, without category grouping or future announcement sections.",
  "frontend/src/components/RegistrationForm.tsx": "React form component for participant registration using react-hook-form and TanStack Query. Collects personal information (name, email, phone, address, age category) and submits to the backend actor, showing a success component upon completion.",
  "frontend/src/components/RegistrationSuccess.tsx": "Success screen component displayed after registration, showing the participant ID, next steps, and action buttons to view prizes or return home.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using TanStack Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom hooks wrapping TanStack Query for fetching participants and prizes, and mutating participant registration data through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), defining colors for primary, accent, background, and UI components using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page component featuring a hero banner, event information cards (date, location, categories), and call-to-action buttons for registration and viewing prizes.",
  "frontend/src/pages/PrizesPage.tsx": "Page component displaying the prizes and awards section with a header and the PrizesDisplay component showing available prizes by category.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page component that displays a hero banner, payment details, registration instructions, and the registration form for the Jhajha Marathon 2026.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, container settings, border radius variables, shadows, fonts, and animation keyframes.",
  "project_state.json": "Project state tracking file documenting completed features to remove category grouping and 'more prizes to be announced' section from the prizes display."
}