{
  "backend/main.mo": "Main actor defining Participant and Prize types with registration and prize management functions, including participant registration with address field, querying participants and prizes, and migration support.",
  "backend/migration.mo": "Migration module that transforms old participant data (with emergency contact) to new schema (with address field), preserving existing data while defaulting address to empty string.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: adding address field, removing emergency contact section, adding organizer contact in footer, and creating payment details section with UPI and QR code.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing routing, layout with organizer contact, registration form with address field (no emergency contact), payment details component with PhonePe QR and UPI ID, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining OKLCH color system for light and dark themes, including primary, accent, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Jhajha Marathon Organizer application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with three routes (home, register, prizes) wrapped in Layout component.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky gradient header, responsive navigation, marathon branding with trophy icon, mobile menu, and footer displaying organizer contact (7069180465) and caffeine.ai attribution.",
  "frontend/src/components/PaymentDetails.tsx": "Payment information component displaying PhonePe QR code image, payee name (Raman Kumar Asbariya), UPI ID (7069180465@ybl) with copy-to-clipboard functionality, and payment instructions.",
  "frontend/src/components/PrizesDisplay.tsx": "Displays marathon prizes by category with loading/error states, fetching data via React Query from the backend actor. Renders prize cards with placement-specific icons, colors, and details including category, amount, and description.",
  "frontend/src/components/RegistrationForm.tsx": "Provides a registration form for marathon participants using react-hook-form for validation and React Query for submission. Collects personal information (name, email, phone, address) and age category, then displays a success component upon successful registration.",
  "frontend/src/components/RegistrationSuccess.tsx": "Displays a success message after participant registration with the assigned participant ID, next steps instructions, and action buttons to view prizes or return home.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation, identity state, and login status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching participants and prizes, and a mutation hook for registering new participants that invalidates the participants cache on success.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, accent, background, and component-specific color tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page for Jhajha Marathon 2026 with hero banner, event info cards (date, location, participants), and call-to-action buttons for registration and viewing prizes.",
  "frontend/src/pages/PrizesPage.tsx": "Displays marathon prizes and awards across multiple categories using the PrizesDisplay component with a trophy icon header.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page that displays payment details (UPI/QR code), registration instructions, and the RegistrationForm component for participant sign-up.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended utilities for animations, shadows, and typography plugins.",
  "project_state.json": "Project state tracking file documenting implemented features (registration form, prizes display, payment details, design theme) and pending feature requests for the Jhajha Marathon website."
}